<template>
    <div>
        <div class="bg-opacity-25 grid grid-cols-1 md:grid-cols-2">
            <div class="p-6">
                <inertia-link :href="route('my.products')">
                    <div class="flex items-center">
                        <svg class="w-8 h-8" viewBox="0 0 43 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M31.5781 1.34375H11.4219C10.3531 1.34495 9.32842 1.77006 8.57268 2.5258C7.81693 3.28155 7.39183 4.30621 7.39062 5.375V38.9688C7.39143 39.6813 7.67483 40.3644 8.17866 40.8682C8.68249 41.372 9.3656 41.6554 10.0781 41.6562H32.9219C33.6344 41.6554 34.3175 41.372 34.8213 40.8682C35.3252 40.3644 35.6086 39.6813 35.6094 38.9688V5.375C35.6082 4.30621 35.1831 3.28155 34.4273 2.5258C33.6716 1.77006 32.6469 1.34495 31.5781 1.34375ZM32.9219 38.9688H10.0781V20.1562H32.9219V38.9688ZM32.9219 17.4688H10.0781V5.375C10.0785 5.01874 10.2203 4.6772 10.4722 4.42529C10.7241 4.17338 11.0656 4.03167 11.4219 4.03125H31.5781C31.9344 4.03167 32.2759 4.17338 32.5278 4.42529C32.7797 4.6772 32.9215 5.01874 32.9219 5.375V17.4688Z"
                                fill="#10B42B"/>
                            <path d="M12.0938 23.5156H14.7812V31.5781H12.0938V23.5156Z" fill="#10B42B"/>
                            <path d="M12.0938 8.73438H14.7812V14.1094H12.0938V8.73438Z" fill="#10B42B"/>
                        </svg>
                        <div class="ml-4 text-lg text-gray-600 leading-7 font-semibold">Мой
                            холодильник
                        </div>
                    </div>
                </inertia-link>
            </div>

            <div class="p-6  border-t border-gray-200 md:border-t-0 md:border-l">
                <inertia-link :href="route('my.recipes')">
                    <div class="flex items-center">
                        <svg class="w-8 h-8 text-gray-400" viewBox="0 0 44 44" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M38.5 20.1667H33V7.33333C33 6.8471 32.8068 6.38079 32.463 6.03697C32.1192 5.69315 31.6529 5.5 31.1666 5.5H5.49996C5.01373 5.5 4.54741 5.69315 4.2036 6.03697C3.85978 6.38079 3.66663 6.8471 3.66663 7.33333V33C3.66663 36.0323 6.13429 38.5 9.16663 38.5H34.8333C37.8656 38.5 40.3333 36.0323 40.3333 33V22C40.3333 21.5138 40.1401 21.0475 39.7963 20.7036C39.4525 20.3598 38.9862 20.1667 38.5 20.1667ZM9.16663 34.8333C8.6804 34.8333 8.21408 34.6402 7.87026 34.2964C7.52645 33.9525 7.33329 33.4862 7.33329 33V9.16667H29.3333V33C29.3333 33.6435 29.4451 34.2613 29.6468 34.8333H9.16663ZM36.6666 33C36.6666 33.4862 36.4735 33.9525 36.1297 34.2964C35.7858 34.6402 35.3195 34.8333 34.8333 34.8333C34.3471 34.8333 33.8807 34.6402 33.5369 34.2964C33.1931 33.9525 33 33.4862 33 33V23.8333H36.6666V33Z"
                                fill="#10B42B"/>
                            <path
                                d="M11 12.8333H25.6667V16.5H11V12.8333ZM11 20.1667H25.6667V23.8333H11V20.1667ZM20.1667 27.5H25.6667V31.1667H20.1667V27.5Z"
                                fill="#10B42B"/>
                        </svg>

                        <div class="ml-4 text-lg text-gray-600 leading-7 font-semibold">Доступные
                            рецепты
                        </div>
                    </div>
                </inertia-link>
            </div>

            <div class="p-6 border-t border-gray-200 ">
                <inertia-link :href="route('types.index')">
                    <div class="flex items-center">
                        <svg class="w-8 h-8 text-gray-400" viewBox="0 0 19 19" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <circle cx="9.5" cy="9.5" r="9" fill="white" stroke="#10B42B"/>
                            <line x1="9.5" y1="5" x2="9.5" y2="14" stroke="#10B42B"/>
                            <line x1="14" y1="9.5" x2="5" y2="9.5" stroke="#10B42B"/>
                        </svg>
                        <div class="ml-4 text-lg text-gray-600 leading-7 font-semibold">Добавить
                            продукты</div>
                    </div>
                </inertia-link>
            </div>

            <div class="p-6 border-t border-gray-200 md:border-l ">
                <inertia-link :href="route('recipes.index')">
                    <div class="flex items-center">
                        <svg class="w-8 h-8 text-gray-400" viewBox="0 0 44 44" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M38.5 20.1667H33V7.33333C33 6.8471 32.8068 6.38079 32.463 6.03697C32.1192 5.69315 31.6529 5.5 31.1666 5.5H5.49996C5.01373 5.5 4.54741 5.69315 4.2036 6.03697C3.85978 6.38079 3.66663 6.8471 3.66663 7.33333V33C3.66663 36.0323 6.13429 38.5 9.16663 38.5H34.8333C37.8656 38.5 40.3333 36.0323 40.3333 33V22C40.3333 21.5138 40.1401 21.0475 39.7963 20.7036C39.4525 20.3598 38.9862 20.1667 38.5 20.1667ZM9.16663 34.8333C8.6804 34.8333 8.21408 34.6402 7.87026 34.2964C7.52645 33.9525 7.33329 33.4862 7.33329 33V9.16667H29.3333V33C29.3333 33.6435 29.4451 34.2613 29.6468 34.8333H9.16663ZM36.6666 33C36.6666 33.4862 36.4735 33.9525 36.1297 34.2964C35.7858 34.6402 35.3195 34.8333 34.8333 34.8333C34.3471 34.8333 33.8807 34.6402 33.5369 34.2964C33.1931 33.9525 33 33.4862 33 33V23.8333H36.6666V33Z"
                                fill="#10B42B"/>
                            <path
                                d="M11 12.8333H25.6667V16.5H11V12.8333ZM11 20.1667H25.6667V23.8333H11V20.1667ZM20.1667 27.5H25.6667V31.1667H20.1667V27.5Z"
                                fill="#10B42B"/>
                        </svg>
                        <div class="ml-4 text-lg text-gray-600 leading-7 font-semibold">Все рецепты</div>
                    </div>
                </inertia-link>
            </div>
        </div>
    </div>
</template>

<script>
import JetApplicationLogo from '@/Jetstream/ApplicationLogo'

export default {
    components: {
        JetApplicationLogo,
    },
}
</script>
